/******************************************************************************
    
	This file is part of CppSources, which is part of UserLib.

    Copyright (C) 1995-2014  Oliver Kreis (okdev10@arcor.de)

    This library is free software: you can redistribute it and/or modify
    it under the terms of the GNU Lesser General Public License as published 
	by the Free Software Foundation, either version 3 of the License, or
    (at your option) any later version.

    This program is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
    GNU Lesser General Public License for more details.

    You should have received a copy of the GNU Lesser General Public License
    along with this program.  If not, see <http://www.gnu.org/licenses/>.

******************************************************************************/
#include "CPPS_PCH.H"
#include "ZipArchive.h"
#include "ZipFilter.h"
#include "File.h"
#ifdef OK_SYS_WINDOWS
#include "DirectoryIterator.h"
#endif

class CPPSOURCES_LOCAL ZipCommon
{
public:
	enum
	{
		HEADER_SIZE = 4
	};

	enum CompressionMethod
	{
		CM_STORE   = 0,
		CM_SHRUNK  = 1,
		CM_FACTOR1 = 2,
		CM_FACTOR2 = 3,
		CM_FACTOR3 = 4,
		CM_FACTOR4 = 5,
		CM_IMPLODE = 6,
		CM_TOKENIZE= 7,
		CM_DEFLATE = 8,
		CM_ENHANCEDDEFLATE = 9,
		CM_DATECOMPRIMPLODING = 10,
		CM_UNUSED = 11
	};

	enum CompressionLevel
	{
		CL_NORMAL    = 0,
		CL_MAXIMUM   = 1,
		CL_FAST      = 2,
		CL_SUPERFAST = 3
	};

	enum HostSystem
	{
		HS_FAT = 0,  // + PKZIPW 2.50 VFAT, NTFS
		HS_AMIGA = 1,
		HS_VMS = 2,
		HS_UNIX = 3,
		HS_VM_CMS = 4,
		HS_ATARI = 5,
		HS_HPFS = 6,
		HS_MACINTOSH = 7,
		HS_ZSYSTEM = 8,
		HS_CP_M = 9,
		HS_TOPS20 = 10, // used by pkzip2.5 to indicate ntfs
		HS_NTFS = 11,
		HS_SMS_QDOS = 12,
		HS_ACORN = 13,
		HS_VFAT = 14,
		HS_MVS = 15,
		HS_BEOS = 16,
		HS_TANDEM = 17,
		HS_UNUSED = 18
	};

	enum FileType
	{
		FT_BINARY= 0,
		FT_ASCII = 1
	};
};

#ifdef OK_COMP_MSC
#pragma pack(push, 2)
#define HAVE_PRAGMA_PACK
#endif
#ifdef OK_COMP_GNUC
#undef HAVE_PRAGMA_PACK
#endif
struct CPPSOURCES_LOCAL TLocalFileHeader
{
//	dword signature; // 0x04034b50
	word version_needed_to_extract; // 0
	word general_purpose_bit_flag;  // 2
	word compression_method;        // 4
	word last_mod_file_time;        // 6
	word last_mod_file_date;        // 8
	dword crc32;                    // 10
	dword compressed_size;          // 14
	dword uncompressed_size;        // 18
	word file_name_length;          // 22
	word extra_field_length;        // 24
};            // 26

struct CPPSOURCES_LOCAL TFileHeader
{
//	dword signature; // 0x02014b50 
    word version_made_by;			// 0
    word version_needed_to_extract; // 2
    word general_purpose_bit_flag;  // 4
    word compression_method;        // 6
    word last_mod_file_time;        // 8
    word last_mod_file_date;        // 10
    dword crc32;                    // 12
    dword compressed_size;          // 16
    dword uncompressed_size;        // 20
    word file_name_length;          // 24
    word extra_field_length;        // 26
    word file_comment_length;       // 28
    word disk_number_start;         // 30
    word internal_file_attributes;  // 32
    dword external_file_attributes; // 34
    dword relative_offset_of_local_header; // 38
};                                  // 42

struct CPPSOURCES_LOCAL TArchiveInfo
{
//	dword signature; // 0x06054b50
    word number_of_this_disk;                        // 0
    word number_of_disk_of_central_dir_start;        // 2
    word number_entries_in_central_dir_on_this_disk; // 4
    word total_number_entries_in_central_dir;        // 6
    dword size_of_the_central_directory;             // 8
    dword central_dir_start_offset_in_disk;          // 12
    word zip_file_comment_length;                    // 16
};                                                   // 18

struct CPPSOURCES_LOCAL TNTFSExtraInfo
{
	word extratag; // 0000a                  // 0 
	word totalsize;                          // 2
	dword reserved0;                         // 4
	// tagdata
	struct __attrdata
	{
		word attrtag;                        // 8   0
		word attrsize;                       // 10  2
		qword mtime; // last modified time   // 12  4
		qword atime; // last access time     // 20  12
		qword ctime; // creation time        // 28  20
	} data;                                  //     28
};                                           // 36
#ifdef OK_COMP_MSC
#pragma pack(pop)
#endif

class CPPSOURCES_LOCAL ZipLocalFileHeader: public CCppObject
{
public:
	ZipLocalFileHeader()
	{
#ifdef HAVE_PRAGMA_PACK
		assert(26 == sizeof(TLocalFileHeader));
		m_header.set_BufferSize(__FILE__LINE__ sizeof(TLocalFileHeader));
#else
